{
    "CrPC 154": {
        "title": "संज्ञेय मामलों में सूचना",
        "keywords": [
            "एफआईआर",
            "पुलिस रिपोर्ट",
            "शिकायत",
            "संज्ञेय अपराध"
        ],
        "summary": "जब किसी संज्ञेय अपराध के बारे में सूचना मौखिक रूप से पुलिस अधिकारी को दी जाती है, तो उसे लिखित रूप में दर्ज किया जाएगा, सूचनादाता को पढ़कर सुनाया जाएगा, और सूचना देने वाले व्यक्ति द्वारा हस्ताक्षरित किया जाएगा। इस लिखित दस्तावेज़ को प्रथम सूचना रिपोर्ट (एफआईआर) के रूप में जाना जाता है।",
        "steps": [
            "उस पुलिस स्टेशन पर जाएं जिसके क्षेत्राधिकार में अपराध हुआ है।",
            "प्रभारी अधिकारी को घटना के बारे में विस्तृत जानकारी प्रदान करें।",
            "सुनिश्चित करें कि एफआईआर में सभी महत्वपूर्ण विवरण दर्ज किए गए हैं।",
            "एफआईआर की एक मुफ्त प्रति प्राप्त करें क्योंकि यह आपका अधिकार है।",
            "यदि पुलिस एफआईआर दर्ज करने से इनकार करती है, तो पुलिस अधीक्षक या मजिस्ट्रेट से संपर्क करें।"
        ]
    },
    "CrPC 161": {
        "title": "पुलिस द्वारा गवाहों की जांच",
        "keywords": [
            "गवाह का बयान",
            "पुलिस जांच",
            "गवाही"
        ],
        "summary": "कोई भी पुलिस अधिकारी जो मामले की जांच कर रहा है, किसी भी व्यक्ति की जांच कर सकता है जो मामले के तथ्यों और परिस्थितियों से परिचित प्रतीत होता है। ऐसे व्यक्ति को सभी प्रश्नों का सच्चाई से उत्तर देना होगा, सिवाय उन प्रश्नों के जो उन्हें आपराधिक आरोपों के संपर्क में ला सकते हैं।",
        "steps": [
            "पूछताछ के लिए बुलाए जाने पर जांच अधिकारी के साथ सहयोग करें।",
            "प्रश्नों का सच्चाई से और पूरी तरह से उत्तर दें।",
            "आप उन प्रश्नों का उत्तर देने से इनकार कर सकते हैं जो आपको आरोपित कर सकते हैं।",
            "अपने बयान को सही ढंग से दर्ज करने का अनुरोध करें।",
            "आपको एक वकील की उपस्थिति में अपना बयान देने का अधिकार है।"
        ]
    },
    "CrPC 164": {
        "title": "स्वीकारोक्ति और बयानों का अभिलेखन",
        "keywords": [
            "स्वीकारोक्ति",
            "मजिस्ट्रेट",
            "बयान रिकॉर्डिंग"
        ],
        "summary": "एक मेट्रोपॉलिटन मजिस्ट्रेट या न्यायिक मजिस्ट्रेट जांच के दौरान उन्हें दिए गए किसी भी स्वीकारोक्ति या बयान को दर्ज कर सकता है। मजिस्ट्रेट को यह सुनिश्चित करना चाहिए कि स्वीकारोक्ति स्वैच्छिक है और व्यक्ति को सूचित करना चाहिए कि वे स्वीकारोक्ति देने के लिए बाध्य नहीं हैं।",
        "steps": [
            "मजिस्ट्रेट यह सुनिश्चित करेंगे कि आप स्वेच्छा से बयान दे रहे हैं।",
            "मजिस्ट्रेट को यह समझाना होगा कि आप स्वीकारोक्ति देने के लिए बाध्य नहीं हैं।",
            "स्वीकारोक्ति को कानून द्वारा निर्धारित तरीके से दर्ज किया जाना चाहिए।",
            "यदि स्वीकारोक्ति जबरन ली गई प्रतीत होती है, तो मजिस्ट्रेट उसे दर्ज नहीं करेंगे।",
            "रिकॉर्डिंग के बाद, मजिस्ट्रेट बयान को उस मजिस्ट्रेट को भेजेंगे जिसके पास मामले का अधिकार क्षेत्र है।"
        ]
    },
    "CrPC 41": {
        "title": "जब पुलिस बिना वारंट के गिरफ्तार कर सकती है",
        "keywords": [
            "गिरफ्तारी",
            "बिना वारंट",
            "पुलिस अधिकार"
        ],
        "summary": "एक पुलिस अधिकारी कुछ परिस्थितियों में बिना वारंट के किसी व्यक्ति को गिरफ्तार कर सकता है, जैसे जब कोई संज्ञेय अपराध अधिकारी की उपस्थिति में किया जाता है, या जब यह उचित संदेह है कि व्यक्ति ने कारावास से दंडनीय संज्ञेय अपराध किया है।",
        "steps": [
            "पुलिस को आपको गिरफ्तारी के कारणों के बारे में सूचित करना होगा।",
            "आपको अपनी गिरफ्तारी के बारे में किसी मित्र या रिश्तेदार को सूचित करने का अधिकार है।",
            "आपको पूछताछ के दौरान एक वकील से मिलने का अधिकार है।",
            "पुलिस को आपको गिरफ्तारी के 24 घंटे के भीतर मजिस्ट्रेट के सामने पेश करना होगा।",
            "आपको गिरफ्तारी के बाद चिकित्सा परीक्षण का अधिकार है।"
        ]
    },
    "CrPC 436": {
        "title": "किन मामलों में जमानत ली जाएगी",
        "keywords": [
            "जमानत",
            "जमानती अपराध",
            "रिहाई"
        ],
        "summary": "जब गैर-जमानती अपराध के आरोपी के अलावा किसी भी व्यक्ति को बिना वारंट के गिरफ्तार या हिरासत में लिया जाता है, या वह अदालत के समक्ष पेश होता है, तो उसे जमानत पर रिहा किया जा सकता है। यदि व्यक्ति गरीब है और जमानत नहीं दे सकता, तो अदालत उसे व्यक्तिगत मुचलके पर रिहा कर सकती है।",
        "steps": [
            "जमानती अपराधों के लिए पुलिस स्टेशन पर जमानत के लिए आवेदन करें।",
            "यदि पुलिस स्टेशन पर इनकार किया जाता है, तो जमानत के लिए अदालत का रुख करें।",
            "आवश्यक जमानतदार या बॉन्ड राशि प्रदान करें।",
            "जमानत के लिए अदालत द्वारा लगाई गई सभी शर्तों का पालन करें।",
            "जमानत की शर्तों के अनुसार सभी अदालती सुनवाई में भाग लें।"
        ]
    }
}