{
    "CrPC 154": {
        "title": "বিজ্ঞেয় মামলায় তথ্য",
        "keywords": [
            "এফআইআর",
            "পুলিশ রিপোর্ট",
            "অভিযোগ",
            "বিজ্ঞেয় অপরাধ"
        ],
        "summary": "যখন কোনো বিজ্ঞেয় অপরাধের বিষয়ে মৌখিকভাবে পুলিশ অফিসারকে তথ্য দেওয়া হয়, তখন তা লিখিতভাবে নথিভুক্ত করা হবে, তথ্যদাতাকে পড়ে শোনানো হবে, এবং তথ্য প্রদানকারী ব্যক্তি দ্বারা স্বাক্ষরিত হবে। এই লিখিত দলিলটি প্রথম তথ্য রিপোর্ট (এফআইআর) হিসাবে পরিচিত।",
        "steps": [
            "যে পুলিশ স্টেশনের এলাকায় অপরাধটি ঘটেছে সেখানে যান।",
            "ভারপ্রাপ্ত অফিসারকে ঘটনার বিস্তারিত তথ্য দিন।",
            "নিশ্চিত করুন যে এফআইআরে সমস্ত গুরুত্বপূর্ণ বিবরণ নথিভুক্ত করা হয়েছে।",
            "এফআইআরের একটি বিনামূল্যে কপি নিন কারণ এটি আপনার অধিকার।",
            "যদি পুলিশ এফআইআর নথিভুক্ত করতে অস্বীকার করে, তাহলে পুলিশ সুপারিনটেন্ডেন্ট বা ম্যাজিস্ট্রেটের কাছে যান।"
        ]
    },
    "CrPC 161": {
        "title": "পুলিশ দ্বারা সাক্ষীদের জিজ্ঞাসাবাদ",
        "keywords": [
            "সাক্ষীর বিবৃতি",
            "পুলিশ তদন্ত",
            "সাক্ষ্য"
        ],
        "summary": "যে কোনো পুলিশ অফিসার যিনি একটি মামলা তদন্ত করছেন, তিনি যে কোনো ব্যক্তিকে জিজ্ঞাসাবাদ করতে পারেন যিনি মামলার তথ্য ও পরিস্থিতি সম্পর্কে অবগত বলে মনে হয়। এই ব্যক্তিকে সমস্ত প্রশ্নের সত্যতার সাথে উত্তর দিতে হবে, সেই প্রশ্নগুলি ছাড়া যা তাদের অপরাধমূলক অভিযোগের সম্মুখীন করতে পারে।",
        "steps": [
            "জিজ্ঞাসাবাদের জন্য ডাকা হলে তদন্তকারী অফিসারের সাথে সহযোগিতা করুন।",
            "প্রশ্নগুলির সত্যতার সাথে এবং সম্পূর্ণভাবে উত্তর দিন।",
            "আপনি সেই প্রশ্নগুলির উত্তর দিতে অস্বীকার করতে পারেন যা আপনাকে অভিযুক্ত করতে পারে।",
            "আপনার বিবৃতি সঠিকভাবে নথিভুক্ত করার অনুরোধ করুন।",
            "আপনার একজন আইনজীবীর উপস্থিতিতে বিবৃতি দেওয়ার অধিকার আছে।"
        ]
    },
    "CrPC 164": {
        "title": "স্বীকারোক্তি ও বিবৃতি রেকর্ডিং",
        "keywords": [
            "স্বীকারোক্তি",
            "ম্যাজিস্ট্রেট",
            "বিবৃতি রেকর্ডিং"
        ],
        "summary": "একজন মেট্রোপলিটন ম্যাজিস্ট্রেট বা জুডিশিয়াল ম্যাজিস্ট্রেট তদন্তের সময় তাদের কাছে করা যে কোনো স্বীকারোক্তি বা বিবৃতি রেকর্ড করতে পারেন। ম্যাজিস্ট্রেটকে নিশ্চিত করতে হবে যে স্বীকারোক্তি স্বেচ্ছাকৃত এবং ব্যক্তিকে জানাতে হবে যে তারা স্বীকারোক্তি দিতে বাধ্য নয়।",
        "steps": [
            "ম্যাজিস্ট্রেট নিশ্চিত করবেন যে আপনি স্বেচ্ছায় বিবৃতি দিচ্ছেন।",
            "ম্যাজিস্ট্রেটকে ব্যাখ্যা করতে হবে যে আপনি স্বীকারোক্তি দিতে বাধ্য নন।",
            "স্বীকারোক্তি আইন দ্বারা নির্ধারিত পদ্ধতিতে রেকর্ড করতে হবে।",
            "যদি স্বীকারোক্তি জোরপূর্বক বলে মনে হয়, তাহলে ম্যাজিস্ট্রেট তা রেকর্ড করবেন না।",
            "রেকর্ডিং করার পর, ম্যাজিস্ট্রেট বিবৃতিটি সেই ম্যাজিস্ট্রেটের কাছে পাঠাবেন যার মামলার উপর এখতিয়ার আছে।"
        ]
    },
    "CrPC 41": {
        "title": "যখন পুলিশ পরোয়ানা ছাড়া গ্রেফতার করতে পারে",
        "keywords": [
            "গ্রেফতার",
            "পরোয়ানা ছাড়া",
            "পুলিশের ক্ষমতা"
        ],
        "summary": "একজন পুলিশ অফিসার কিছু পরিস্থিতিতে পরোয়ানা ছাড়াই একজন ব্যক্তিকে গ্রেফতার করতে পারেন, যেমন যখন অফিসারের উপস্থিতিতে একটি বিজ্ঞেয় অপরাধ সংঘটিত হয়, বা যখন যুক্তিসঙ্গত সন্দেহ থাকে যে ব্যক্তি কারাদণ্ডযোগ্য একটি বিজ্ঞেয় অপরাধ করেছেন।",
        "steps": [
            "পুলিশকে আপনাকে গ্রেফতারের কারণ জানাতে হবে।",
            "আপনার গ্রেফতার সম্পর্কে একজন বন্ধু বা আত্মীয়কে জানানোর অধিকার আপনার আছে।",
            "জিজ্ঞাসাবাদের সময় আপনার একজন আইনজীবীর সাথে দেখা করার অধিকার আছে।",
            "পুলিশকে আপনাকে গ্রেফতারের 24 ঘন্টার মধ্যে একজন ম্যাজিস্ট্রেটের সামনে হাজির করতে হবে।",
            "গ্রেফতারের পর আপনার চিকিৎসা পরীক্ষার অধিকার আছে।"
        ]
    },
    "CrPC 436": {
        "title": "কোন ক্ষেত্রে জামিন নেওয়া হবে",
        "keywords": [
            "জামিন",
            "জামিনযোগ্য অপরাধ",
            "মুক্তি"
        ],
        "summary": "যখন অ-জামিনযোগ্য অপরাধে অভিযুক্ত ব্যক্তি ছাড়া অন্য কোনো ব্যক্তিকে পরোয়ানা ছাড়া গ্রেফতার বা আটক করা হয়, বা তিনি আদালতে হাজির হন, তাকে জামিনে মুক্তি দেওয়া যেতে পারে। যদি ব্যক্তি দরিদ্র হন এবং জামিন দিতে না পারেন, আদালতে তাকে ব্যক্তিগত মুচলেকায় মুক্তি দিতে পারে।",
        "steps": [
            "জামিনযোগ্য অপরাধের জন্য পুলিশ স্টেশনে জামিনের আবেদন করুন।",
            "যদি পুলিশ স্টেশনে অস্বীকার করা হয়, তাহলে জামিনের জন্য আদালতে যান।",
            "প্রয়োজনীয় জামিনদার বা বন্ড পরিমাণ প্রদান করুন।",
            "আদালত দ্বারা জামিনের জন্য আরোপিত সমস্ত শর্ত মেনে চলুন।",
            "জামিনের শর্ত অনুযায়ী সমস্ত আদালতের শুনানিতে উপস্থিত থাকুন।"
        ]
    }
}