{
    "IPC 302": {
        "title": "हत्या",
        "keywords": [
            "हत्या",
            "मार डाला",
            "जान से मारना",
            "मौत"
        ],
        "summary": "हत्या के लिए सजा। जो कोई हत्या करेगा, उसे मृत्युदंड या आजीवन कारावास से दंडित किया जाएगा।",
        "steps": [
            "तुरंत पुलिस को सूचित करें (100 डायल करें)।",
            "घटना, स्थान और शामिल व्यक्तियों का विवरण प्रदान करें।",
            "जांच और पोस्टमार्टम के दौरान सहयोग करें।",
            "प्रतिनिधित्व के लिए एक वकील नियुक्त करें।"
        ]
    },
    "IPC 376": {
        "title": "बलात्कार",
        "keywords": [
            "बलात्कार",
            "यौन हमला",
            "जबरदस्ती संभोग"
        ],
        "summary": "बलात्कार के लिए सजा। जो कोई बलात्कार करेगा, उसे कम से कम 7 वर्ष के कारावास से दंडित किया जाएगा, जिसे आजीवन कारावास तक बढ़ाया जा सकता है।",
        "steps": [
            "तुरंत पुलिस को सूचित करें (100 डायल करें)।",
            "नजदीकी अस्पताल में मेडिकल परीक्षण करवाएं।",
            "घटना का विस्तृत विवरण दर्ज करें।",
            "महिला पुलिस अधिकारी द्वारा बयान दर्ज कराएं।",
            "मानसिक स्वास्थ्य सहायता प्राप्त करें।"
        ]
    },
    "IPC 304B": {
        "title": "दहेज हत्या",
        "keywords": [
            "दहेज",
            "दहेज मृत्यु",
            "दहेज हत्या"
        ],
        "summary": "दहेज हत्या के लिए सजा। यदि किसी महिला की विवाह के 7 वर्ष के भीतर असामान्य परिस्थितियों में मृत्यु होती है और यह साबित होता है कि उसके साथ दहेज के लिए क्रूरता या उत्पीड़न किया गया था, तो उसके पति या रिश्तेदारों को कम से कम 7 वर्ष के कारावास से दंडित किया जाएगा, जिसे आजीवन कारावास तक बढ़ाया जा सकता है।",
        "steps": [
            "तुरंत पुलिस को सूचित करें (100 डायल करें)।",
            "पोस्टमार्टम रिपोर्ट प्राप्त करें।",
            "दहेज से संबंधित सभी साक्ष्य एकत्र करें (फोटो, पत्र, आदि)।",
            "गवाहों की पहचान करें और उनके बयान दर्ज करें।",
            "महिला आयोग से संपर्क करें।"
        ]
    },
    "IPC 498A": {
        "title": "पति या उसके रिश्तेदारों द्वारा क्रूरता",
        "keywords": [
            "घरेलू हिंसा",
            "पति द्वारा क्रूरता",
            "ससुराल वालों द्वारा उत्पीड़न"
        ],
        "summary": "यदि किसी महिला के पति या उसके रिश्तेदार उसके साथ क्रूरता करते हैं, तो उन्हें 3 वर्ष तक के कारावास और जुर्माने से दंडित किया जा सकता है।",
        "steps": [
            "महिला हेल्पलाइन (1091) या पुलिस (100) को कॉल करें।",
            "घटनाओं का विस्तृत विवरण और तिथियां नोट करें।",
            "चोटों के चिकित्सा प्रमाण प्राप्त करें, यदि कोई हो।",
            "महिला थाने में शिकायत दर्ज करें।",
            "सुरक्षित आश्रय की व्यवस्था करें, यदि आवश्यक हो।"
        ]
    },
    "IPC 354": {
        "title": "महिला की शालीनता भंग करने के इरादे से हमला या आपराधिक बल",
        "keywords": [
            "छेड़छाड़",
            "अश्लील इशारे",
            "शालीनता भंग"
        ],
        "summary": "जो कोई किसी महिला की शालीनता भंग करने के इरादे से उस पर हमला करेगा या आपराधिक बल का प्रयोग करेगा, उसे 1 से 5 वर्ष तक के कारावास और जुर्माने से दंडित किया जाएगा।",
        "steps": [
            "तुरंत पुलिस को सूचित करें (100 डायल करें)।",
            "घटना का विवरण और गवाहों की जानकारी नोट करें।",
            "महिला पुलिस अधिकारी के समक्ष शिकायत दर्ज करें।",
            "यदि सार्वजनिक स्थान पर घटना हुई है, तो CCTV फुटेज की जांच करें।",
            "परामर्श सेवाओं से संपर्क करें, यदि आवश्यक हो।"
        ]
    }
}