{
    "IPC 302": {
        "title": "ਕਤਲ",
        "keywords": [
            "ਕਤਲ",
            "ਮਾਰ ਦਿੱਤਾ",
            "ਜਾਨ ਲੈਣਾ",
            "ਮੌਤ"
        ],
        "summary": "ਕਤਲ ਦੀ ਸਜ਼ਾ। ਜੋ ਵੀ ਕਤਲ ਕਰਦਾ ਹੈ, ਉਸਨੂੰ ਮੌਤ ਦੀ ਸਜ਼ਾ ਜਾਂ ਉਮਰ ਕੈਦ ਦੀ ਸਜ਼ਾ ਦਿੱਤੀ ਜਾਵੇਗੀ।",
        "steps": [
            "ਤੁਰੰਤ ਪੁਲਿਸ ਨੂੰ ਸੂਚਿਤ ਕਰੋ (100 'ਤੇ ਕਾਲ ਕਰੋ)।",
            "ਘਟਨਾ, ਸਥਾਨ ਅਤੇ ਸ਼ਾਮਲ ਵਿਅਕਤੀਆਂ ਦੇ ਵੇਰਵੇ ਪ੍ਰਦਾਨ ਕਰੋ।",
            "ਜਾਂਚ ਅਤੇ ਪੋਸਟਮਾਰਟਮ ਦੌਰਾਨ ਸਹਿਯੋਗ ਕਰੋ।",
            "ਪ੍ਰਤੀਨਿਧਤਾ ਲਈ ਇੱਕ ਵਕੀਲ ਨਿਯੁਕਤ ਕਰੋ।"
        ]
    },
    "IPC 376": {
        "title": "ਬਲਾਤਕਾਰ",
        "keywords": [
            "ਬਲਾਤਕਾਰ",
            "ਜਿਨਸੀ ਹਮਲਾ",
            "ਜਬਰਦਸਤੀ ਜਿਨਸੀ ਸੰਬੰਧ"
        ],
        "summary": "ਬਲਾਤਕਾਰ ਦੀ ਸਜ਼ਾ। ਜੋ ਵੀ ਬਲਾਤਕਾਰ ਦਾ ਦੋਸ਼ੀ ਹੋਵੇਗਾ, ਉਸਨੂੰ ਘੱਟੋ-ਘੱਟ 7 ਸਾਲ ਦੀ ਕੈਦ ਦੀ ਸਜ਼ਾ ਦਿੱਤੀ ਜਾਵੇਗੀ, ਜਿਸ ਨੂੰ ਉਮਰ ਕੈਦ ਤੱਕ ਵਧਾਇਆ ਜਾ ਸਕਦਾ ਹੈ।",
        "steps": [
            "ਤੁਰੰਤ ਪੁਲਿਸ ਨੂੰ ਸੂਚਿਤ ਕਰੋ (100 'ਤੇ ਕਾਲ ਕਰੋ)।",
            "ਨਜ਼ਦੀਕੀ ਹਸਪਤਾਲ ਵਿੱਚ ਮੈਡੀਕਲ ਜਾਂਚ ਕਰਵਾਓ।",
            "ਘਟਨਾ ਦੇ ਵਿਸਤ੍ਰਿਤ ਵੇਰਵੇ ਦਰਜ ਕਰੋ।",
            "ਮਹਿਲਾ ਪੁਲਿਸ ਅਧਿਕਾਰੀ ਦੇ ਸਾਹਮਣੇ ਬਿਆਨ ਦਰਜ ਕਰਵਾਓ।",
            "ਮਾਨਸਿਕ ਸਿਹਤ ਸਹਾਇਤਾ ਪ੍ਰਾਪਤ ਕਰੋ।"
        ]
    },
    "IPC 304B": {
        "title": "ਦਾਜ ਮੌਤ",
        "keywords": [
            "ਦਾਜ",
            "ਦਾਜ ਮੌਤ",
            "ਦਾਜ ਕਤਲ"
        ],
        "summary": "ਦਾਜ ਮੌਤ ਦੀ ਸਜ਼ਾ। ਜੇਕਰ ਕਿਸੇ ਔਰਤ ਦੀ ਵਿਆਹ ਦੇ 7 ਸਾਲਾਂ ਦੇ ਅੰਦਰ ਅਸਧਾਰਨ ਹਾਲਾਤਾਂ ਵਿੱਚ ਮੌਤ ਹੋ ਜਾਂਦੀ ਹੈ ਅਤੇ ਇਹ ਸਾਬਤ ਹੁੰਦਾ ਹੈ ਕਿ ਉਸ ਨਾਲ ਦਾਜ ਲਈ ਜ਼ੁਲਮ ਜਾਂ ਪਰੇਸ਼ਾਨ ਕੀਤਾ ਗਿਆ ਸੀ, ਤਾਂ ਉਸਦੇ ਪਤੀ ਜਾਂ ਰਿਸ਼ਤੇਦਾਰਾਂ ਨੂੰ ਘੱਟੋ-ਘੱਟ 7 ਸਾਲ ਦੀ ਕੈਦ ਦੀ ਸਜ਼ਾ ਦਿੱਤੀ ਜਾਵੇਗੀ, ਜਿਸ ਨੂੰ ਉਮਰ ਕੈਦ ਤੱਕ ਵਧਾਇਆ ਜਾ ਸਕਦਾ ਹੈ।",
        "steps": [
            "ਤੁਰੰਤ ਪੁਲਿਸ ਨੂੰ ਸੂਚਿਤ ਕਰੋ (100 'ਤੇ ਕਾਲ ਕਰੋ)।",
            "ਪੋਸਟਮਾਰਟਮ ਰਿਪੋਰਟ ਪ੍ਰਾਪਤ ਕਰੋ।",
            "ਦਾਜ ਨਾਲ ਸੰਬੰਧਿਤ ਸਾਰੇ ਸਬੂਤ ਇਕੱਠੇ ਕਰੋ (ਤਸਵੀਰਾਂ, ਪੱਤਰ, ਆਦਿ)।",
            "ਗਵਾਹਾਂ ਦੀ ਪਛਾਣ ਕਰੋ ਅਤੇ ਉਨ੍ਹਾਂ ਦੇ ਬਿਆਨ ਰਿਕਾਰਡ ਕਰੋ।",
            "ਮਹਿਲਾ ਕਮਿਸ਼ਨ ਨਾਲ ਸੰਪਰਕ ਕਰੋ।"
        ]
    },
    "IPC 498A": {
        "title": "ਪਤੀ ਜਾਂ ਉਸਦੇ ਰਿਸ਼ਤੇਦਾਰਾਂ ਦੁਆਰਾ ਜ਼ੁਲਮ",
        "keywords": [
            "ਘਰੇਲੂ ਹਿੰਸਾ",
            "ਪਤੀ ਦਾ ਜ਼ੁਲਮ",
            "ਸਹੁਰੇ ਪਰਿਵਾਰ ਦੁਆਰਾ ਪਰੇਸ਼ਾਨੀ"
        ],
        "summary": "ਜੇਕਰ ਕਿਸੇ ਔਰਤ ਦੇ ਪਤੀ ਜਾਂ ਉਸਦੇ ਰਿਸ਼ਤੇਦਾਰ ਉਸ 'ਤੇ ਜ਼ੁਲਮ ਕਰਦੇ ਹਨ, ਤਾਂ ਉਨ੍ਹਾਂ ਨੂੰ 3 ਸਾਲ ਤੱਕ ਦੀ ਕੈਦ ਅਤੇ ਜੁਰਮਾਨੇ ਦੀ ਸਜ਼ਾ ਦਿੱਤੀ ਜਾ ਸਕਦੀ ਹੈ।",
        "steps": [
            "ਮਹਿਲਾ ਹੈਲਪਲਾਈਨ (1091) ਜਾਂ ਪੁਲਿਸ (100) ਨੂੰ ਕਾਲ ਕਰੋ।",
            "ਘਟਨਾਵਾਂ ਦੇ ਵਿਸਤ੍ਰਿਤ ਵੇਰਵੇ ਅਤੇ ਤਾਰੀਖਾਂ ਨੋਟ ਕਰੋ।",
            "ਸੱਟਾਂ ਦੇ ਮੈਡੀਕਲ ਸਬੂਤ ਪ੍ਰਾਪਤ ਕਰੋ, ਜੇਕਰ ਕੋਈ ਹੋਵੇ।",
            "ਮਹਿਲਾ ਥਾਣੇ ਵਿੱਚ ਸ਼ਿਕਾਇਤ ਦਰਜ ਕਰਵਾਓ।",
            "ਜੇਕਰ ਜ਼ਰੂਰੀ ਹੋਵੇ ਤਾਂ ਸੁਰੱਖਿਅਤ ਆਸਰਾ ਦਾ ਪ੍ਰਬੰਧ ਕਰੋ।"
        ]
    },
    "IPC 354": {
        "title": "ਔਰਤ ਦੀ ਸ਼ਾਲੀਨਤਾ ਨੂੰ ਠੇਸ ਪਹੁੰਚਾਉਣ ਦੇ ਇਰਾਦੇ ਨਾਲ ਹਮਲਾ ਜਾਂ ਅਪਰਾਧਿਕ ਬਲ",
        "keywords": [
            "ਛੇੜਛਾੜ",
            "ਅਸ਼ਲੀਲ ਇਸ਼ਾਰੇ",
            "ਸ਼ਾਲੀਨਤਾ ਨੂੰ ਠੇਸ ਪਹੁੰਚਾਉਣਾ"
        ],
        "summary": "ਜੋ ਵੀ ਕਿਸੇ ਔਰਤ ਦੀ ਸ਼ਾਲੀਨਤਾ ਨੂੰ ਠੇਸ ਪਹੁੰਚਾਉਣ ਦੇ ਇਰਾਦੇ ਨਾਲ ਉਸ 'ਤੇ ਹਮਲਾ ਕਰੇਗਾ ਜਾਂ ਅਪਰਾਧਿਕ ਬਲ ਦੀ ਵਰਤੋਂ ਕਰੇਗਾ, ਉਸਨੂੰ 1 ਤੋਂ 5 ਸਾਲ ਤੱਕ ਦੀ ਕੈਦ ਅਤੇ ਜੁਰਮਾਨੇ ਦੀ ਸਜ਼ਾ ਦਿੱਤੀ ਜਾਵੇਗੀ।",
        "steps": [
            "ਤੁਰੰਤ ਪੁਲਿਸ ਨੂੰ ਸੂਚਿਤ ਕਰੋ (100 'ਤੇ ਕਾਲ ਕਰੋ)।",
            "ਘਟਨਾ ਦੇ ਵੇਰਵੇ ਅਤੇ ਗਵਾਹਾਂ ਦੀ ਜਾਣਕਾਰੀ ਨੋਟ ਕਰੋ।",
            "ਮਹਿਲਾ ਪੁਲਿਸ ਅਧਿਕਾਰੀ ਦੇ ਸਾਹਮਣੇ ਸ਼ਿਕਾਇਤ ਦਰਜ ਕਰਵਾਓ।",
            "ਜੇਕਰ ਜਨਤਕ ਜਗ੍ਹਾ 'ਤੇ ਘਟਨਾ ਹੋਈ ਹੈ, ਤਾਂ ਸੀਸੀਟੀਵੀ ਫੁਟੇਜ ਦੀ ਜਾਂਚ ਕਰੋ।",
            "ਜੇਕਰ ਜ਼ਰੂਰੀ ਹੋਵੇ ਤਾਂ ਕਾਉਂਸਲਿੰਗ ਸੇਵਾਵਾਂ ਨਾਲ ਸੰਪਰਕ ਕਰੋ।"
        ]
    }
}