{
    "IPC 302": {
        "title": "قتل",
        "keywords": [
            "قتل",
            "مار دیا",
            "جان سے مارنا",
            "موت"
        ],
        "summary": "قتل کی سزا۔ جو کوئی قتل کرے گا، اسے موت کی سزا یا عمر قید کی سزا دی جائے گی۔",
        "steps": [
            "فوراً پولیس کو مطلع کریں (100 ڈائل کریں)۔",
            "واقعہ، مقام اور ملوث افراد کی تفصیلات فراہم کریں۔",
            "تحقیقات اور پوسٹ مارٹم کے دوران تعاون کریں۔",
            "نمائندگی کے لیے ایک وکیل مقرر کریں۔"
        ]
    },
    "IPC 376": {
        "title": "زنا بالجبر",
        "keywords": [
            "زنا بالجبر",
            "جنسی حملہ",
            "جبری جنسی تعلق"
        ],
        "summary": "زنا بالجبر کی سزا۔ جو کوئی زنا بالجبر کا مرتکب ہوگا، اسے کم از کم 7 سال کی قید کی سزا دی جائے گی، جسے عمر قید تک بڑھایا جا سکتا ہے۔",
        "steps": [
            "فوراً پولیس کو مطلع کریں (100 ڈائل کریں)۔",
            "قریبی ہسپتال میں طبی معائنہ کروائیں۔",
            "واقعہ کی تفصیلی معلومات درج کریں۔",
            "خاتون پولیس افسر کے سامنے بیان درج کرائیں۔",
            "ذہنی صحت کی مدد حاصل کریں۔"
        ]
    },
    "IPC 304B": {
        "title": "جہیز قتل",
        "keywords": [
            "جہیز",
            "جہیز موت",
            "جہیز قتل"
        ],
        "summary": "جہیز قتل کی سزا۔ اگر کسی عورت کی شادی کے 7 سال کے اندر غیر معمولی حالات میں موت ہو جاتی ہے اور یہ ثابت ہوتا ہے کہ اس کے ساتھ جہیز کے لیے ظلم یا ہراساں کیا گیا تھا، تو اس کے شوہر یا رشتہ داروں کو کم از کم 7 سال کی قید کی سزا دی جائے گی، جسے عمر قید تک بڑھایا جا سکتا ہے۔",
        "steps": [
            "فوراً پولیس کو مطلع کریں (100 ڈائل کریں)۔",
            "پوسٹ مارٹم رپورٹ حاصل کریں۔",
            "جہیز سے متعلق تمام ثبوت جمع کریں (تصاویر، خطوط، وغیرہ)۔",
            "گواہوں کی شناخت کریں اور ان کے بیانات ریکارڈ کریں۔",
            "خواتین کمیشن سے رابطہ کریں۔"
        ]
    },
    "IPC 498A": {
        "title": "شوہر یا اس کے رشتہ داروں کی طرف سے ظلم",
        "keywords": [
            "گھریلو تشدد",
            "شوہر کا ظلم",
            "سسرال والوں کی طرف سے ہراساں کرنا"
        ],
        "summary": "اگر کسی عورت کے شوہر یا اس کے رشتہ دار اس پر ظلم کرتے ہیں، تو انہیں 3 سال تک کی قید اور جرمانے کی سزا دی جا سکتی ہے۔",
        "steps": [
            "خواتین ہیلپ لائن (1091) یا پولیس (100) کو کال کریں۔",
            "واقعات کی تفصیلی معلومات اور تاریخیں نوٹ کریں۔",
            "زخموں کے طبی ثبوت حاصل کریں، اگر کوئی ہو۔",
            "خواتین تھانے میں شکایت درج کرائیں۔",
            "ضرورت پڑنے پر محفوظ پناہ گاہ کا انتظام کریں۔"
        ]
    },
    "IPC 354": {
        "title": "عورت کی شائستگی کو خراب کرنے کے ارادے سے حملہ یا مجرمانہ طاقت",
        "keywords": [
            "چھیڑ چھاڑ",
            "فحش اشارے",
            "شائستگی خراب کرنا"
        ],
        "summary": "جو کوئی کسی عورت کی شائستگی کو خراب کرنے کے ارادے سے اس پر حملہ کرے گا یا مجرمانہ طاقت کا استعمال کرے گا، اسے 1 سے 5 سال تک کی قید اور جرمانے کی سزا دی جائے گی۔",
        "steps": [
            "فوراً پولیس کو مطلع کریں (100 ڈائل کریں)۔",
            "واقعہ کی تفصیلات اور گواہوں کی معلومات نوٹ کریں۔",
            "خاتون پولیس افسر کے سامنے شکایت درج کرائیں۔",
            "اگر عوامی جگہ پر واقعہ ہوا ہے، تو سی سی ٹی وی فوٹیج کی جانچ کریں۔",
            "ضرورت پڑنے پر مشاورتی خدمات سے رابطہ کریں۔"
        ]
    }
}